
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>课程概述 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="pythonweb01.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    课程概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="pythonweb01.html">
            
                <a href="pythonweb01.html">
            
                    
                    课程大纲
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="python环境搭建.html">
            
                <a href="python环境搭建.html">
            
                    
                    Python环境搭建
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pycharm软件安装.html">
            
                <a href="pycharm软件安装.html">
            
                    
                    pycharm软件安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="mysql安装.html">
            
                <a href="mysql安装.html">
            
                    
                    mysql安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="python基础语法.html">
            
                <a href="python基础语法.html">
            
                    
                    python基础语法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="前端开发.html">
            
                <a href="前端开发.html">
            
                    
                    前端开发
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >课程概述</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;">web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;</h1>
<p>Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x662F;&#x4ECE;&#x4E8B;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x4E3B;&#x8981;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#xFF0C;&#x4F18;&#x5316;&#xFF0C;&#x5B8C;&#x5584;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x662F;Web 1.0&#x65F6;&#x4EE3;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x90A3;&#x65F6;&#x7F51;&#x7AD9;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7F51;&#x7AD9;&#x7684;&#x884C;&#x4E3A;&#x4E5F;&#x4EE5;&#x6D4F;&#x89C8;&#x4E3A;&#x4E3B;&#x3002;
&#x4E00;&#x4F4D;&#x597D;&#x7684;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E0A;&#x65E2;&#x8981;&#x6709;&#x5E7F;&#x5EA6;&#xFF0C;&#x53C8;&#x8981;&#x6709;&#x6DF1;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x5927;&#x516C;&#x53F8;&#x5373;&#x4F7F;&#x51FA;&#x9AD8;&#x85AA;&#x4E5F;&#x5F88;&#x96BE;&#x62DB;&#x8058;&#x5230;&#x7406;&#x60F3;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x73B0;&#x5728;&#x8BF4;&#x7684;&#x91CD;&#x70B9;&#x4E0D;&#x5728;&#x4E8E;&#x8BB2;&#x89E3;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x5BF9;&#x6280;&#x5DE7;&#x7684;&#x8BB2;&#x89E3;&#x3002;&#x6280;&#x672F;&#x975E;&#x9ED1;&#x5373;&#x767D;&#xFF0C;&#x53EA;&#x6709;&#x5BF9;&#x548C;&#x9519;&#xFF0C;&#x800C;&#x6280;&#x5DE7;&#x5219;&#x89C1;&#x4EC1;&#x89C1;&#x667A;&#x3002;&#x4EE5;&#x524D;&#x4F1A;Photoshop&#x548C;Dreamweaver&#x5C31;&#x53EF;&#x4EE5;&#x5236;&#x4F5C;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x4E86;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5F00;&#x53D1;&#x96BE;&#x5EA6;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x4E0A;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x90FD;&#x66F4;&#x63A5;&#x8FD1;&#x4F20;&#x7EDF;&#x7684;&#x7F51;&#x7AD9;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x4E0D;&#x518D;&#x53EB;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#xFF0C;&#x800C;&#x662F;&#x53EB;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5728;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x73AF;&#x8282;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E14;&#x9700;&#x8981;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x624D;&#x80FD;&#x505A;&#x597D;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x4E1A;&#x4EBA;&#x624D;&#x8FD1;&#x4E24;&#x5E74;&#x6765;&#x5907;&#x53D7;&#x9752;&#x7750;&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x9879;&#x5F88;&#x7279;&#x6B8A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6DB5;&#x76D6;&#x7684;&#x77E5;&#x8BC6;&#x9762;&#x975E;&#x5E38;&#x5E7F;&#xFF0C;&#x65E2;&#x6709;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x53C8;&#x6709;&#x62BD;&#x8C61;&#x7684;&#x7406;&#x5FF5;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x804C;&#x80FD;&#x5C31;&#x662F;&#x628A;&#x7F51;&#x7AD9;&#x7684;&#x754C;&#x9762;&#x66F4;&#x597D;&#x5730;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;</p>
<h1 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h1>
<p>2005&#x5E74;&#x4EE5;&#x540E;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x5165;Web 2.0&#x65F6;&#x4EE3;&#xFF0C;&#x5404;&#x79CD;&#x7C7B;&#x4F3C;&#x684C;&#x9762;&#x8F6F;&#x4EF6;&#x7684;Web&#x5E94;&#x7528;&#x5927;&#x91CF;&#x6D8C;&#x73B0;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x524D;&#x7AEF;&#x7531;&#x6B64;&#x53D1;&#x751F;&#x4E86;&#x7FFB;&#x5929;&#x8986;&#x5730;&#x7684;&#x53D8;&#x5316;&#x3002;&#x7F51;&#x9875;&#x4E0D;&#x518D;&#x53EA;&#x662F;&#x627F;&#x8F7D;&#x5355;&#x4E00;&#x7684;&#x6587;&#x5B57;&#x548C;&#x56FE;&#x7247;&#xFF0C;&#x5404;&#x79CD;&#x4E30;&#x5BCC;&#x5A92;&#x4F53;&#x8BA9;&#x7F51;&#x9875;&#x7684;&#x5185;&#x5BB9;&#x66F4;&#x52A0;&#x751F;&#x52A8;&#xFF0C;&#x7F51;&#x9875;&#x4E0A;&#x8F6F;&#x4EF6;&#x5316;&#x7684;&#x4EA4;&#x4E92;&#x5F62;&#x5F0F;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x3002;<br>&#x968F;&#x7740;Web 2.0&#x6982;&#x5FF5;&#x7684;&#x666E;&#x53CA;&#x548C;W3C&#x7EC4;&#x7EC7;&#x7684;&#x63A8;&#x5E7F;&#xFF0C;&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x6B63;&#x4EE5;&#x60CA;&#x4EBA;&#x7684;&#x901F;&#x5EA6;&#x589E;&#x957F;&#x3002;XHTML+CSS&#x5E03;&#x5C40;&#x3001;DHTML&#x548C;Ajax&#x50CF;&#x4E00;&#x9635;&#x65CB;&#x98CE;&#xFF0C;&#x94FA;&#x5929;&#x76D6;&#x5730;&#x5E2D;&#x5377;&#x800C;&#x6765;&#xFF0C;&#x5305;&#x62EC;&#x65B0;&#x6D6A;&#x3001;&#x641C;&#x72D0;&#x3001;&#x7F51;&#x6613;&#x3001;&#x817E;&#x8BAF;&#x3001;&#x6DD8;&#x5B9D;&#x7B49;&#x5728;&#x5185;&#x7684;&#x5404;&#x79CD;&#x89C4;&#x6A21;&#x7684;IT&#x4F01;&#x4E1A;&#x90FD;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x4E86;&#x91CD;&#x6784;&#x3002;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5165;&#x95E8;&#x95E8;&#x69DB;&#x5176;&#x5B9E;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#xFF0C;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8BED;&#x8A00;&#x5148;&#x6162;&#x540E;&#x5FEB;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x76F8;&#x6BD4;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x662F;&#x5148;&#x5FEB;&#x540E;&#x6162;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ECE;&#x4E8B;IT&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;<br>&#x4E5F;&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x6709;&#x5F88;&#x591A;&#x81EA;&#x5B66;&#x7684;&#x540C;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x8D8A;&#x6765;&#x8D8A;&#x9661;&#x5CED;&#xFF0C;&#x6BCF;&#x524D;&#x8FDB;&#x4E00;&#x6B65;&#x90FD;&#x5F88;&#x96BE;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x8BF4;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x65B0;&#x7684;&#x804C;&#x4E1A;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x89C4;&#x8303;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x7814;&#x7A76;&#x90FD;&#x5904;&#x4E8E;&#x63A2;&#x7D22;&#x9636;&#x6BB5;&#x3002;&#x603B;&#x6709;&#x65B0;&#x7684;&#x7075;&#x611F;&#x548C;&#x6280;&#x672F;&#x4E0D;&#x65F6;&#x95EA;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x4F8B;&#x5982;CSS sprite&#x3001;&#x8D1F;&#x8FB9;&#x8DDD;&#x5E03;&#x5C40;&#x3001;&#x6805;&#x683C;&#x5E03;&#x5C40;&#x7B49;&#xFF1B;&#x5404;&#x79CD;JavaScript&#x6846;&#x67B6;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x4E3A;&#x6574;&#x4E2A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x6CE8;&#x5165;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6D3B;&#x529B;&#xFF1B;&#x6D4F;&#x89C8;&#x5668;&#x5927;&#x6218;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x767D;&#x70ED;&#x5316;&#xFF0C;&#x8DE8;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#x4F9D;&#x7136;&#x662F;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x3002;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x201C;&#x9AD8;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x201D;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x6DF1;&#x5165;&#x3001;&#x66F4;&#x7CFB;&#x7EDF;&#x5730;&#x53BB;&#x638C;&#x63E1;&#x524D;&#x7AEF;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x7684;&#x8D28;&#x91CF;&#x3002;   </p>
<h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x5462;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x5462;&#xFF1F;</h1>
<p>&#x5BF9;&#x81EA;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x539F;&#x56E0;&#xFF1A;<br>&#x7B2C;&#x4E00;&#xFF0C;&#x6839;&#x636E;W3C&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x524D;&#x7AEF;&#x7684;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x66F4;&#x6709;&#x5E8F;&#xFF0C;&#x663E;&#x8457;&#x6539;&#x5584;&#x7F51;&#x7AD9;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8FD8;&#x80FD;&#x63D0;&#x9AD8;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4E5F;&#x66F4;&#x53CB;&#x597D;&#xFF1B;<br>&#x7B2C;&#x4E8C;&#xFF0C;&#x91CD;&#x6784;&#x540E;&#x7F51;&#x7AD9;&#x80FD;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x7528;XHTML+CSS&#x91CD;&#x65B0;&#x5E03;&#x5C40;&#x540E;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x6587;&#x4EF6;&#x66F4;&#x5C0F;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;<br>&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x7684;&#x76EE;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x7F51;&#x9875;&#x66F4;&#x7B26;&#x5408;Web&#x6807;&#x51C6;&#x5417;&#xFF1F;&#x4E0D;&#x662F;&#xFF01;&#x91CD;&#x6784;&#x7684;&#x672C;&#x8D28;&#x662F;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x7075;&#x6D3B;&#x7684;&#x7C7B;MVC&#x6846;&#x67B6;&#xFF0C;&#x5373;HTML&#x4F5C;&#x4E3A;&#x4FE1;&#x606F;&#x6A21;&#x578B;&#xFF08;Model&#xFF09;&#xFF0C;CSS&#x63A7;&#x5236;&#x6837;&#x5F0F;&#xFF08;View&#xFF09;&#xFF0C;JavaScript&#x8D1F;&#x8D23;&#x8C03;&#x5EA6;&#x6570;&#x636E;&#x548C;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x5C55;&#x73B0;&#x903B;&#x8F91;&#xFF08;Controller&#xFF09;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x590D;&#x7528;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x8FD9;&#x662F;&#x9AD8;&#x6548;&#x7387;&#x3001;&#x9AD8;&#x8D28;&#x91CF;&#x5F00;&#x53D1;&#x4EE5;&#x53CA;&#x534F;&#x4F5C;&#x5F00;&#x53D1;&#x7684;&#x57FA;&#x7840;&#x3002;<br>DHTML&#x53EF;&#x4EE5;&#x8BA9;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x66F4;&#x70AB;&#xFF0C;&#x66F4;&#x5438;&#x5F15;&#x773C;&#x7403;&#xFF1B;Ajax&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x65E0;&#x5237;&#x65B0;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x66F4;&#x6D41;&#x7545;&#x3002;&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x662F;&#x5426;&#x4E13;&#x4E1A;&#x3001;&#x529F;&#x80FD;&#x662F;&#x5426;&#x5F3A;&#x5927;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x662F;&#x7528;J2EE+Oracle&#x7684;&#x5F3A;&#x5927;&#x7EC4;&#x5408;&#xFF0C;&#x8FD8;&#x662F;&#x7528;ASP+Access&#x7684;&#x7B80;&#x5355;&#x7EC4;&#x5408;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x660E;&#x663E;&#x7684;&#x533A;&#x522B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x524D;&#x7AEF;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x5374;&#x7ED9;&#x4E86;&#x7528;&#x6237;&#x76F4;&#x89C2;&#x7684;&#x5370;&#x8C61;&#x3002;<br>&#x968F;&#x7740;&#x4EBA;&#x4EEC;&#x5BF9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8981;&#x6C42;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x6280;&#x672F;&#x96BE;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD9;&#x4E00;&#x804C;&#x4E1A;&#x7EC8;&#x4E8E;&#x4ECE;&#x8BBE;&#x8BA1;&#x548C;&#x5236;&#x4F5C;&#x4E0D;&#x5206;&#x7684;&#x5C40;&#x9762;&#x4E2D;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#x3002;   </p>
<h1 id="&#x4E09;&#x8981;&#x7D20;">&#x4E09;&#x8981;&#x7D20;</h1>
<p>Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x5305;&#x62EC;&#x4E09;&#x4E2A;&#x8981;&#x7D20;&#xFF1A;HTML&#x3001;CSS&#x548C;JavaScript&#xFF0C;&#x968F;&#x7740;RIA&#x7684;&#x6D41;&#x884C;&#x548C;&#x666E;&#x53CA;&#xFF0C;Flash/Flex&#x3001;Silverlight&#x3001;XML&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x5E94;&#x8BE5;&#x638C;&#x63E1;&#x7684;&#x3002;&#x968F;&#x7740;&#x65F6;&#x4EE3;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x7684;&#x4E09;&#x8981;&#x7D20;&#x4E5F;&#x6F14;&#x53D8;&#x6210;&#x4E3A;&#x73B0;&#x4ECA;&#x7684;&#xFF1A;html5&#xFF0C;css3&#xFF0C;jquery&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x65E2;&#x8981;&#x4E0E;&#x4E0A;&#x6E38;&#x7684;&#x4EA4;&#x4E92;&#x8BBE;&#x8BA1;&#x5E08;&#x3001;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x6C9F;&#x901A;&#xFF0C;&#x53C8;&#x8981;&#x4E0E;&#x4E0B;&#x6E38;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x6C9F;&#x901A;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x6280;&#x80FD;&#x975E;&#x5E38;&#x591A;&#x3002;&#x8FD9;&#x5C31;&#x4ECE;&#x77E5;&#x8BC6;&#x7684;&#x5E7F;&#x5EA6;&#x4E0A;&#x5BF9;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x63D0;&#x51FA;&#x4E86;&#x8981;&#x6C42;&#x3002;&#x5982;&#x679C;&#x8981;&#x7CBE;&#x4E8E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8FD9;&#x4E00;&#x884C;&#xFF0C;&#x4E5F;&#x8BB8;&#x8981;&#x5148;&#x7CBE;&#x5341;&#x884C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5168;&#x624D;&#x603B;&#x662F;&#x5C11;&#x6709;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x201C;&#x901A;&#x201D;&#x5373;&#x53EF;&#x3002;&#x4F46;&#x201C;&#x901A;&#x201D;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x624D;&#x7B97;&#x591F;&#x7528;&#x5462;&#xFF1F;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x521D;&#x7EA7;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x8FF7;&#x60D1;&#x7684;&#x3002;<br>&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5165;&#x95E8;&#x95E8;&#x69DB;&#x5176;&#x5B9E;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#xFF0C;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8BED;&#x8A00;&#x5148;&#x6162;&#x540E;&#x5FEB;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x76F8;&#x6BD4;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x662F;&#x5148;&#x5FEB;&#x540E;&#x6162;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ECE;&#x4E8B;IT&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;&#x4E5F;&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x6709;&#x5F88;&#x591A;&#x81EA;&#x5B66;&#x7684;&#x540C;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x8D8A;&#x6765;&#x8D8A;&#x9661;&#x5CED;&#xFF0C;&#x6BCF;&#x524D;&#x8FDB;&#x4E00;&#x6B65;&#x90FD;&#x5F88;&#x96BE;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x89C4;&#x8303;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x7814;&#x7A76;&#x90FD;&#x5904;&#x4E8E;&#x63A2;&#x7D22;&#x9636;&#x6BB5;&#x3002;&#x5982;&#x4ECA;CSS sprite&#x3001;&#x8D1F;&#x8FB9;&#x8DDD;&#x5E03;&#x5C40;&#x3001;&#x6805;&#x683C;&#x5E03;&#x5C40;&#x7B49;&#xFF1B;&#x5404;&#x79CD;JavaScript&#x6846;&#x67B6;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x4E3A;&#x6574;&#x4E2A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x6CE8;&#x5165;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6D3B;&#x529B;&#xFF1B;&#x6D4F;&#x89C8;&#x5668;&#x5927;&#x6218;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x767D;&#x70ED;&#x5316;&#xFF0C;&#x8DE8;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#x4F9D;&#x7136;&#x662F;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x3002;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x201C;&#x9AD8;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x201D;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x6DF1;&#x5165;&#x3001;&#x66F4;&#x7CFB;&#x7EDF;&#x5730;&#x53BB;&#x638C;&#x63E1;&#x524D;&#x7AEF;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x7684;&#x8D28;&#x91CF;&#x3002;  </p>
<h1 id="&#x5177;&#x5907;&#x6761;&#x4EF6;">&#x5177;&#x5907;&#x6761;&#x4EF6;</h1>
<p>&#x4E00;&#x4F4D;&#x597D;&#x7684;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E0A;&#x65E2;&#x8981;&#x6709;&#x5E7F;&#x5EA6;&#xFF0C;&#x53C8;&#x8981;&#x6709;&#x6DF1;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x5927;&#x516C;&#x53F8;&#x5373;&#x4F7F;&#x51FA;&#x9AD8;&#x85AA;&#x4E5F;&#x5F88;&#x96BE;&#x62DB;&#x8058;&#x5230;&#x7406;&#x60F3;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x73B0;&#x5728;&#x8BF4;&#x7684;&#x91CD;&#x70B9;&#x4E0D;&#x5728;&#x4E8E;&#x8BB2;&#x89E3;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x5BF9;&#x6280;&#x5DE7;&#x7684;&#x8BB2;&#x89E3;&#x3002;&#x6280;&#x672F;&#x975E;&#x9ED1;&#x5373;&#x767D;&#xFF0C;&#x53EA;&#x6709;&#x5BF9;&#x548C;&#x9519;&#xFF0C;&#x800C;&#x6280;&#x5DE7;&#x5219;&#x89C1;&#x4EC1;&#x89C1;&#x667A;&#x3002;&#x4EE5;&#x524D;&#x4F1A;Photoshop&#x548C;Dreamweaver&#x5C31;&#x53EF;&#x4EE5;&#x5236;&#x4F5C;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x4E86;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5F00;&#x53D1;&#x96BE;&#x5EA6;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x4E0A;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x90FD;&#x66F4;&#x63A5;&#x8FD1;&#x4F20;&#x7EDF;&#x7684;&#x7F51;&#x7AD9;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x4E0D;&#x518D;&#x53EB;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#xFF0C;&#x800C;&#x662F;&#x53EB;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5728;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x73AF;&#x8282;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E14;&#x9700;&#x8981;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x624D;&#x80FD;&#x505A;&#x597D;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x4E1A;&#x4EBA;&#x624D;&#x5907;&#x53D7;&#x9752;&#x7750;&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x9879;&#x5F88;&#x7279;&#x6B8A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6DB5;&#x76D6;&#x7684;&#x77E5;&#x8BC6;&#x9762;&#x975E;&#x5E38;&#x5E7F;&#xFF0C;&#x65E2;&#x6709;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x53C8;&#x6709;&#x62BD;&#x8C61;&#x7684;&#x7406;&#x5FF5;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x804C;&#x80FD;&#x5C31;&#x662F;&#x628A;&#x7F51;&#x7AD9;&#x7684;&#x754C;&#x9762;&#x66F4;&#x597D;&#x5730;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;<br>&#x6240;&#x4EE5;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4E0D;&#x5355;&#x5355;&#x9700;&#x8981;&#x638C;&#x63E1;&#x524D;&#x7AEF;&#x5FC5;&#x987B;&#x7684;&#x5404;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x638C;&#x63E1;&#x5176;&#x5B83;&#x6280;&#x672F;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x4E00;&#x70B9;&#x540E;&#x53F0;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x5BF9;&#x7F51;&#x7AD9;&#x6784;&#x67B6;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x638C;&#x63E1;&#x4E00;&#x5B9A;&#x7684;SEO&#x7F51;&#x7AD9;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x4F18;&#x79C0;&#x7684;web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x201D;&#x3002;&#x9664;&#x4E86;&#x6280;&#x672F;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x6C89;&#x6DC0;&#x81EA;&#x5DF1;&#x3002;&#x4E00;&#x540D;&#x8D44;&#x6DF1;&#x7684;&#x4F18;&#x79C0;web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x662F;&#x6BCF;&#x4E2A;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x90FD;&#x6E34;&#x671B;&#x7684;&#x4EBA;&#x624D;&#x3002;&#x4E1A;&#x5185;&#x4EBA;&#x58EB;&#x8868;&#x793A;&#xFF0C;&#x5B81;&#x53EF;&#x9AD8;&#x85AA;&#x62DB;&#x4EBA;&#xFF0C;&#x9669;&#x4F01;&#x4E5F;&#x4E0D;&#x613F;&#x81EA;&#x5DF1;&#x57F9;&#x517B;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x624D;&#x3002;<br>&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x5462;&#xFF1F;<br>&#x7B2C;&#x4E00;&#xFF0C;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7684;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#xFF1A;CSS&#x3001;HTML&#x3001;SEO&#x3001;DOM&#x3001;BOM&#x3001;Ajax&#x3001;JavaScript&#x7B49;&#xFF0C;&#x5728;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x8981;&#x6E05;&#x695A;&#x5730;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x7684;&#x517C;&#x5BB9;&#x60C5;&#x51B5;&#x3001;&#x6E32;&#x67D3;&#x539F;&#x7406;&#x548C;&#x5B58;&#x5728;&#x7684;Bug&#x3002;<br>&#x7B2C;&#x4E8C;&#xFF0C;&#x5728;&#x4E00;&#x540D;&#x5408;&#x683C;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x77E5;&#x8BC6;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x7F51;&#x7AD9;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x3001;SEO&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x4E5F;&#x662F;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x7684;&#x3002;<br>&#x7B2C;&#x4E09;&#xFF0C;&#x5FC5;&#x987B;&#x5B66;&#x4F1A;&#x8FD0;&#x7528;&#x5404;&#x79CD;&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x8F85;&#x52A9;&#x5F00;&#x53D1;&#x3002;<br>&#x7B2C;&#x56DB;&#xFF0C;&#x9664;&#x4E86;&#x8981;&#x638C;&#x63E1;&#x6280;&#x672F;&#x5C42;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD8;&#x8981;&#x638C;&#x63E1;&#x7406;&#x8BBA;&#x5C42;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5305;&#x62EC;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x7EC4;&#x4EF6;&#x7684;&#x6613;&#x7528;&#x6027;&#x3001;&#x5206;&#x5C42;&#x8BED;&#x4E49;&#x6A21;&#x677F;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x5206;&#x7EA7;&#x652F;&#x6301;&#xFF0C;&#x7B49;&#x7B49;&#x3002;<br>&#x53EF;&#x89C1;&#xFF0C;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x4E13;&#x4E1A;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x4E0D;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x8BA9;&#x5F88;&#x591A;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5982;&#x6B64;&#x7E41;&#x6742;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x8BA9;&#x65B0;&#x624B;&#x5B66;&#x4E60;&#x8D77;&#x6765;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#xFF0C;&#x5BF9;&#x4E8E;&#x8001;&#x624B;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x65F6;&#x5E38;&#x4E0D;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x5B66;&#x4EC0;&#x4E48;&#x3002;<br>&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4E2D;&#x5E94;&#x8BE5;&#x91CD;&#x70B9;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x754C;&#x9762;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x65E0;&#x6570;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x65B9;&#x6848;&#x7684;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x4F1A;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x6709;&#x4E9B;&#x65B9;&#x6848;&#x4F1A;&#x5B58;&#x5728;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x65B9;&#x6848;&#x5219;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#xFF0C;&#x800C;&#x4E14;&#x6027;&#x80FD;&#x4E5F;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3002;CSS&#x3001;HTML&#x3001;JavaScript&#x8FD9;&#x4E09;&#x79CD;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x70B9;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5BF9;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x53C8;&#x6709;&#x7740;&#x5343;&#x4E1D;&#x4E07;&#x7F15;&#x7684;&#x8054;&#x7CFB;&#x3002;  </p>
<h2 id="python">Python</h2>
<p>Python&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x578B;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x4EE5;&#x4E0B;&#x9886;&#x57DF;:</p>
<ul>
<li>Web &#x548C; Internet&#x5F00;&#x53D1;</li>
<li>&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x548C;&#x7EDF;&#x8BA1;</li>
<li>&#x6559;&#x80B2;</li>
<li>&#x684C;&#x9762;&#x754C;&#x9762;&#x5F00;&#x53D1;</li>
<li>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;</li>
<li>&#x540E;&#x7AEF;&#x5F00;&#x53D1;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="pythonweb01.html" class="navigation navigation-next " aria-label="Next page: 课程大纲">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"课程概述","level":"1.2","depth":1,"next":{"title":"课程大纲","level":"1.3","depth":1,"path":"pythonweb01.md","ref":"./pythonweb01.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"概述.md","mtime":"2019-10-17T10:09:19.557Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-10-18T01:19:45.299Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

